<div class="task">
<div class="taskh">
<h3>Задание №10</h3>
<pre class="tasktext">Напишите программу-игру в виде отдельного модуля. Компьютер загадывает случайное число, пользователь пытается его угадать. Программа запрашивает число ОДИН раз. Если число угадано, то выводим на экран «Победа», иначе – «Повторите еще раз». Для написания программы понадобится функция <cc>randint()</cc> из модуля <cc>random</cc>.
</pre>
</div>
<div class="taskf"><pre>
<b>Краткое описание:</b>
* Написать модуль, который генерирует случайное число и запрашивает ввод с клавиатуры у пользователя. После этого происходит сравнение чисел  сгенерированного и введённого пользователем и, в случае совпадения - сообщаем о победе, иначе - проигрыш.
* По условию следует запускать игру из другого модуля

<cf>Код программы:</cf>

Основной файл <b>zadanie10.py</b>
</pre><pre><code class="python">import numberGame

numberGame.play()
</code></pre>
<pre>Модуль игры <b>numberGame.py</b></pre>
<pre><code class="python">import random

def play():
    a = random.randint(1, 5)
    b = int( input('Я загадал число от 1 до 5. Ваш ответ: ') )
    if a == b:
        print('Победа')
    else:
        print('Повторите ещё раз')
</code></pre>    
</div>
</div>