<div class="task">
<div class="taskh">
<h3>Задание №2</h3>
<pre class="tasktext">Напишите программу, которая запрашивает у пользователя значение pH (с плавающей точкой) и выводит на экран вещество, соответствующее введенному pH (“Яблочный сок”, “Шампунь”, “Мыло для рук”). Определение pH производится в отдельной функции, которая возвращает строку с названием вещества или фразу “Не найдено”. 
</pre>
</div>
<div class="taskf"><pre>
<b>Краткое описание:</b>
* Загуглить/Придумать содержание водорода (pH) для данных веществ
* Написать метод для определения вещества
* Продемонстрировать работу метода

<b>Подробное описание:</b>
1. Первым делом следует обратиться в Google (или придумать) pH для данных веществ. 

<pre class="taskw">
<b>Яблочный сок:</b> 3.3 - 3.9
<b>Шампунь:</b> 5.6 - 7.0
<b>Мыло для рук:</b> 5.5
</pre>
2. Вторым шагом следует написать простой метод, содержащий один аргумент типа float (число с плавающей точкой/дробное). Далее производим сравнение с известными значениями и возвращаем результат в виде строки (по условию задания).

<cf>Код программы:</cf>
</pre><pre><code class="python">def getProduct(pH):
    if pH >= 3.3 and pH <= 3.9:
        return "Яблочный сок"
    elif pH >= 5.6 and pH <= 7.0:
        return "Шампунь"
    elif pH == 5.5:
        return "Мыло для рук"
    else:
        return "Не найдёно"

pH = float( input('Введите значение pH: ') )
print( getProduct(pH) )
</code></pre>
</div>
</div>