<div class="task">
<div class="taskh">
<h3>Задание №4</h3>
<pre class="tasktext">Напишите программу, проверяющую целое число на четность. Реализовать в виде вызова собственной функции. 
</pre>
</div>
<div class="taskf"><pre>
<b>Краткое описание:</b>
* Запросить с клавиатуры ввод целого числа
* Написать метод для проверки целого числа на чётность
* Продемонстрировать работу метода

<b>Вспомогательная информация:</b>
<pre class="taskw">
Для проверки числа на чётность будем использовать оператор <b>%</b> - возвращает остаток от целочисленного деления числа слева на число справа.
    <cc>Например, 10 % 4 = 2 или 101 % 10 = 1</cc>
Алгоритм проверки: если остаток от деления нашего числа на 2 равен единице, значит число НЕчётное и наоборот.
</pre>
<cf>Код программы:</cf>
</pre><pre><code class="python">def checkParity(num):
    if num % 2 == 0:
        return True
    else:
        return False

a = int( input('Введите целое число: ') )
if checkParity(a) == True:
    print('Число чётное')
else:
    print('Число нечётное')
</code></pre>
</div>
</div>