<div class="task">
<div class="taskh">
<h3>Задание №6</h3>
<pre class="tasktext">Напишите программу, которая по коду города и длительности переговоров вычисляет их стоимость и результат выводит на экран: 
Екатеринбург - код 343, 15 руб/мин; 
Омск - код 381, 18 руб/мин; 
Воронеж - код 473, 13 руб/мин; 
Ярославль-код 485, 11 руб/мин.
</pre>
</div>
<div class="taskf"><pre>
<b>Краткое описание:</b>
* Запросить ввод с клавиатуры два целых числа (код города и время в минутах)
* Написать метод определяющий стоимость звонка по коду города и времени звонка
* Продемонстрировать работу метода

<i>Замечание: в условии задачи сказано вывести только РЕЗУЛЬТАТ (т.е. стоимость самого звонка на экран), поэтому сведения о названии города были проигнорированы</i>

<cf>Код программы:</cf>
</pre><pre><code class="python">def callPrice(code, time):
    if code == 343:
        return 15 * time
    elif code == 381:
        return 18 * time
    elif code == 473:
        return 13 * time
    elif code == 485:
        return 11 * time

a = int( input('Введите код города: ') )
b = int( input('Введите длительность разговора (в минутах): ') )
print( 'Стоимость звонка составляет', callPrice(a, b), 'рублей' )
</code></pre>
</div>
</div>